# GetCurves Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravel..::..GetCurves Method
PathOfTravel Class See Also
---
Gets the array of curves representing the path of travel.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public IList<Curve> GetCurves()
```

Visual Basic
---
```text
Public Function GetCurves As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetCurves()
```

# ### Return Value
The array of curves.
# See Also
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace